src/Documents/гф_УстановкаСнятиеЛимита.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_УстановкаСнятиеЛимита</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гф_ВидыОперацийЛимита</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_СтатусыЛимитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЛимита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ВидыЛимитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/гф_УстановкаСнятиеЛимита/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
// #wortmann {
// Формируем движения документа
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30 
&Вместо("ОбработкаПроведения")
Процедура гф_ОбработкаПроведения(Отказ, Режим)
	Движения.гф_ЛимитыКонтрагентов.Записывать = Истина;
	Движение = Движения.гф_ЛимитыКонтрагентов.Добавить();
	Движение.Период = НачалоДня(Дата);
	Движение.Контрагент = Контрагент;
	Движение.Организация = Организация;
	Движение.ВидЛимита = ВидЛимита;
	Движение.Статус = Статус;
	Движение.Сумма = Сумма;
	Движение.Партнер = Партнер;
КонецПроцедуры

// } #wortmann
// #wortmann {
// Заполнение поля Ответственный по текущему пользователю 
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30 
&Вместо("ОбработкаЗаполнения")
Процедура гф_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный  = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("ВидОперации", ВидОперации);
	КонецЕсли;
	
КонецПроцедуры
// } #wortmann 

// #wortmann {
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30 
&После("ПриКопировании")
Процедура гф_ПриКопировании(ОбъектКопирования)
		ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
	// #wortmann {
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee5219ab65a092
	// Галфинд_Домнышева_14_09_2023
	Ответственный = Пользователи.ТекущийПользователь();
	Комментарий = "";
	// } #wortmann
КонецПроцедуры
// } #wortmann

// } #wortmann
// #wortmann {
// Заполнение поля Контрагент по реквизиту Партнер 
// #4.1.15
// Галфинд Волков 2023/02/20
&Вместо("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент, Истина);
	//ПродолжитьВызов(Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры // } #wortmann

// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee5219ab65a092
// Галфинд_Домнышева_14_09_2023
&Вместо("ПриУстановкеНовогоНомера")
Процедура гф_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = Организация.Префикс;
КонецПроцедуры
// } #wortmann

#КонецОбласти

#КонецЕсли
